<?xml version="1.0" ?>
<net name="saved_model" version="11">
	<layers>
		<layer id="0" name="input_tensor" type="Parameter" version="opset1">
			<data shape="1,640,640,3" element_type="u8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input_tensor"/>
				<attribute name="old_api_map_element_type" version="0" value="f32"/>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1"/>
			</rt_info>
			<output>
				<port id="0" precision="U8" names="Func/StatefulPartitionedCall/input/_0:0,input_tensor,input_tensor:0">
					<dim>1</dim>
					<dim>640</dim>
					<dim>640</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="3399_input_port_0/value_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="0" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="3399_input_port_0/value" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="3399_input_port_0/value"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Convert_2482" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="3398, input_tensor/Transpose([0 3 1 2])"/>
			</rt_info>
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>640</dim>
					<dim>640</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>640</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="input_tensor/Transpose([0 3 1 2])/value5966073877" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input_tensor/Transpose([0 3 1 2])/value5966073877"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="3398" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="3398, input_tensor/Transpose([0 3 1 2])"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>640</dim>
					<dim>640</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="3399" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="3399"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="3401_input_port_1/value_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="34" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="3401_input_port_1/value" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="3401_input_port_1/value"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="3401" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="3401"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/map/TensorArrayV2Stack/TensorListStack:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/bn_Conv1/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="36" size="1728"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/bn_Conv1/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/bn_Conv1/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_44504_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1764" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="data_add_44504" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_44504"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/bn_Conv1/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/bn_Conv1/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/bn_Conv1/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1_relu/Relu6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1_relu/Relu6:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="1828" size="576"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise/depthwise/ReadVariableOp:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise/depthwise"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="data_add_4450744512_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="2404" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="data_add_4450744512" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_4450744512"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_relu/Relu6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="2468" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="data_add_4451544520_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="3492" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="data_add_4451544520" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_4451544520"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project_BN/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 16, 1, 1" offset="3524" size="3072"/>
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand/Conv2D/ReadVariableOp:0">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="data_add_4452344528_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="6596" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="data_add_4452344528" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_4452344528"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_BN/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_relu/Relu6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_relu/Relu6:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 1, 1, 3, 3" offset="6788" size="1728"/>
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise/depthwise/ReadVariableOp:0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise/depthwise"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="data_add_4453144536_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="8516" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="data_add_4453144536" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_4453144536"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_relu/Relu6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 96, 1, 1" offset="8708" size="4608"/>
			<output>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project/Conv2D/ReadVariableOp:0">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="data_add_4453944544_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="13316" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="data_add_4453944544" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_4453944544"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project_BN/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="13364" size="6912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand/Conv2D/ReadVariableOp:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="data_add_4454744552_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="20276" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="data_add_4454744552" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_4454744552"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_BN/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_relu/Relu6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_relu/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="20564" size="2592"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise/depthwise/ReadVariableOp:0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise/depthwise"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="data_add_4455544560_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="23156" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="data_add_4455544560" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_4455544560"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_relu/Relu6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 144, 1, 1" offset="23444" size="6912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project/Conv2D/ReadVariableOp:0">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_add_4456344568_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="30356" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="data_add_4456344568" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="data_add_4456344568"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project_BN/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_add/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_add/add:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="30404" size="6912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_expand/Conv2D/ReadVariableOp:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_expand/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
